import enum


class UserRestrictionsDescription(enum.Enum):
    MERGE_ACCOUNTS = 'به‌دلیل ادغام دو حساب کاربری‌تان، تا {duration} ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیاز نیست با پشتیبانی تماس بگیرید.'
    CHANGE_PHONE_NUMBER = 'به‌دلیل تغییر شماره موبایل، تا {duration} ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی نوبیتکس تماس بگیرید.'
    CHANGE_PASSWORD = 'به‌دلیل تغییر رمز عبور، تا {duration} ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی نوبیتکس تماس بگیرید.'
    RECOVERY_PASSWORD = 'به‌دلیل بازیابی رمز عبور، تا {duration} ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی نوبیتکس تماس بگیرید.'
    ADD_ADDRESS_BOOK = 'به‌دلیل افزودن آدرس به دفتر آدرس‌ها، تا {duration} ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی نوبیتکس تماس بگیرید.'
    INACTIVE_SECURE_WITHDRAWAL = 'به‌دلیل غیرفعالسازی برداشت امن، تا {duration} ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی نوبیتکس تماس بگیرید.'
    INACTIVE_2FA = 'به‌دلیل غیرفعالسازی کد دو عاملی، تا ۲۴ ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی تماس بگیرید.'
    EMERGENCY_CANCELLATION_WITHDRAWAL = 'به‌دلیل لغو اضطراری برداشت، تا {duration} ساعت نمی‌توانید تومان و رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی نوبیتکس تماس بگیرید.'
    DEPOSIT_NUMBER_IS_IN_BLACKLIST = 'برداشت تومان و رمزارز شما محدود شده است.'
    REQUEST_NUMBER_IS_IN_BLACKLIST = 'برداشت تومان و رمزارز شما محدود شده است.'
    NEW_DEVICE_LOGIN = 'به‌دلیل ورود به حساب کاربری با دستگاه جدید، تا {duration} ساعت نمی‌توانید رمزارز برداشت کنید. این محدودیت خودکار رفع می‌شود و نیازی نیست با پشتیبانی نوبیتکس تماس بگیرید.'
    WITHDRAW_DEFAULT = 'برداشت تومان و رمزارز شما محدود شده است. برای اطلاع بیشتر، لطفا با کارشناس پشتیبانی چت کنید.'
    WITHDRAW_RIAL_DEFAULT = 'برداشت تومان شما محدود شده است. برای اطلاع بیشتر، لطفا با کارشناس پشتیبانی چت کنید.'
    WITHDRAW_COIN_DEFAULT = 'برداشت رمزارز شما محدود شده است. برای اطلاع بیشتر، لطفا با کارشناس پشتیبانی چت کنید.'
    ACTIVE_TARA_CREDIT = 'به دلیل فعال بودن اعتبار تارا،‌ امکان ویرایش شماره موبایل وجود ندارد.'
